/* By https://github.com/DIEGO-OFC/DORRAT-BOT-MD */
import fs from "fs"
let handler = m => m
 handler.all = async function (m, { conn, command, text }) {
    let chat = global.db.data.chats[m.chat]
    let x=`${pickRandom(global.piropo)}`
  let top = `*${x}*`

if (/^تب$/i.test(m.text) && !chat.isBanned) {

    m.reply(top, null)}}
export default handler


function pickRandom(list) {
  return list[Math.floor(list.length * Math.random())]
}
global.piropo = ["فيجيتا","غوكو","شيسوي","ايتاتشي","ناروتو","كيلوا","لوفي زورو سانجي","زاراكي ايزن توسين","ناروتو ساسكي كاكاشي","مادارا اوبيتو","هاشيراما توبيراما","انزاي دازاي","هاغومورو","سوكونا يوجي","كاكاشي هاتاكي","فوغاكو اوتشيها","ناروتو اوزوماكي","غارب لوفي ايس سابو","اكاينو اوكيجي كيزارو","كيلوا غون","اوميني","سيلفا زينو نيترو","استا يامي","كيسكي يوروتشي ايتشيغو","ساروتوبي دانزو","فوجيتورا","نامي روبين","هيماواري هيناتا","ستارك جريمجو نيل","الوكا","شينو كيبا","روك لي مايت غاي","ايتاشي ساسكي","كونان ناغاتو ياهيكو","جيرايا تسونادي","ساي اينو","شينرا","ثوركيل ثورفين ثورز","اشيلاد","لاو ميهوك زورو","تيتش ادوارد","ناكا اوتشيها","هيروزين ساروتوبي","مونكي دي لوفي","كارين","موريا","اشورا هامورا","انيوشا كاجومي","ديدارا ساسوري","روجر رايلي","تانجيرو نيزيكو","زينيتسو اينوسكي","زيك ايرين","ميكاسا اني","ليفاي اكيرمان","ايروين مايكي","مايكي دراكن","هيسوكا","ارمين","هاتسوني ميكو","كورو","اوراهارا كيسكي","شينوبو كاناو","كيسامي اكاشي","كوزان"]