import fs from "fs"
let handler = m => m
 handler.all = async function (m, { conn, command, text }) {
    let chat = global.db.data.chats[m.chat]
   
 let x = `${pickRandom([ 'سي سي','لولوش' ,'نير',' ميسا', 'ال','لايت' ,'غون',' كيلوا', 'ليوريو','هيسوكا' ,'كورابيكا','الوكا' ,'جين فريكس','اشيلاد' ,'ثورفين', 'استا' ,'سيبر ','كوشينا' ,'ميناتو','تيماري' , 'شيكامارو','باين' ,'ايتاتشي', 'ريم','رين','شيسوي' ,'كاكاشي','اوبيتو', 'مادارا',' لي' ,'غاي','ساكورا' ,'هيناتا', 'ساسكي' ,'ناروتو' ,'اسونا','كيريتو' ,'يوتا','نانامي', 'سوكونا','يوجي', 'نوبارا','ميغومي' ,'غوجو','زينو' ,'هاك','يونا' ,'تينغن ','رينغوكو', 'توكيتو','كوكوشيبو' ,'يوريتشي','ميتسوري' ,'سانيمي','اوباناي', 'شينوبو','غيو' ,'كاناو','لاك' ,'ماغنا','نويل ','يامي', 'يونو','فينرال', 'شوتو','باكوغو' ,'ديكو','اول مايت' ,'دابي','توغا', 'تانجيرو','نيزوكو' ,'زينيتسو','اينوسكي', 'دوما','اكازا', 'موزان','كيم','روبين','هانكوك', 'اشيلاد','مادارا','لوفي','نامي', 'اوسوب','شانكس','غيو','اثي', 'نيزوكو','ساسكي','ناروتو', 'ميكاسا','ايرين','ايروين', 'ثورفين','ثوركيل','شيكي','كايدو','ارمين','جان','تانجيرو','ريفانا','ميليوداس','كينغ','غوثر', 'إسكانور','مارلين','يونو','استا',' يامي','يوسارين','ليخت','موبو','ادوارد','ال','لايت','كاغامي', 'كوروكو',' ياغامي','كيرا','اشيتو','ايساغي','روي','تيماري','ساكورا','اينو','ايتشيغو','اوراهارا','ايزن','ياماتو','رينغوكو','اينوسكي','كو','فوتابا','رين','ريوسي','غوجو','يوجي','سوكونا','ريفي','فيفي','زورو','سانجي','فرانكي','انيا', 'يور','اودين','لويد','ليفاي','زيك','ماي','ماري','توكا','كانيكي','شو','ايسي','شين','غون','غاي','كيلوا','ليوريو','بان','ياتشيرو','زاراكي','كيوراكو',' ايشيدا','نيرو',"فيجيتا","غوكو","شيسوي","ايتاتشي","ناروتو","كيلوا","لوفي زورو سانجي","زاراكي ايزن توسين","ناروتو ساسكي كاكاشي","مادارا اوبيتو","هاشيراما توبيراما","انزاي دازاي","هاغومورو","سوكونا يوجي","كاكاشي هاتاكي","فوغاكو اوتشيها","ناروتو اوزوماكي","غارب لوفي ايس سابو","اكاينو اوكيجي كيزارو","كيلوا غون","اوميني","سيلفا زينو نيترو","استا يامي","كيسكي يوروتشي ايتشيغو","ساروتوبي دانزو","فوجيتورا","نامي روبين","هيماواري هيناتا","ستارك جريمجو نيل","الوكا","شينو كيبا","روك لي مايت غاي","ايتاشي ساسكي","كونان ناغاتو ياهيكو","جيرايا تسونادي","ساي اينو","شينرا","ثوركيل ثورفين ثورز","اشيلاد","لاو ميهوك زورو","تيتش ادوارد","ناكا اوتشيها","هيروزين ساروتوبي","مونكي دي لوفي","كارين","موريا","اشورا هامورا","انيوشا كاجومي","ديدارا ساسوري","روجر رايلي","تانجيرو نيزيكو","زينيتسو اينوسكي","زيك ايرين","ميكاسا اني","ليفاي اكيرمان","ايروين مايكي","مايكي دراكن","هيسوكا","ارمين","هاتسوني ميكو","كورو","اوراهارا كيسكي","شينوبو كاناو","كيسامي اكاشي","كوزان" ])}`

let l = Math.floor(Math.random() * x.length);

let top = `*${x}*`

if (/^كت$/i.test(m.text) && !chat.isBanned) {

    m.reply(top, null)}}
export default handler
function pickRandom(list) {
return list[Math.floor(Math.random() * list.length)]}